---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurvesError
source: html/82e6e1b8-27c1-e9a1-9bff-06040a6d3c98.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurvesError Property

Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairNotEnoughBoundaryCurvesError { get; }
```